In [1]:
import pandas as pd
import numpy as np
from sklearn.model_selection import train_test_split
from sklearn.ensemble import RandomForestClassifier
from sklearn.linear_model import LogisticRegression

In [2]:
# df = pd.read_csv("titanic.csv")
df = pd.read_csv("Titanic-Dataset.csv")

In [3]:
df.sample()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
353,354,0,3,"Arnold-Franchi, Mr. Josef",male,25.0,1,0,349237,17.8,NaN,S

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [5]:
data_1 = df.copy()

In [6]:
data_1.sample()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
93,94,0,3,"Dean, Mr. Bertram Frank",male,26.0,1,2,C.A. 2315,20.575,NaN,S

In [7]:
data_1["Pclass"] = data_1["Pclass"].replace({1:"first class",2:"second class",3:"third class"})

In [8]:
data_1["Embarked"] = data_1["Embarked"].replace({"C":"Cherbourg","Q":"Queenstown","S":"Southampton"})

In [9]:
data_1.sample(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
14,15,0,third class,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,0,0,350406,7.8542,NaN,Southampton
213,214,0,second class,"Givard, Mr. Hans Kristensen",male,30.0,0,0,250646,13.0000,NaN,Southampton
733,734,0,second class,"Berriman, Mr. William John",male,23.0,0,0,28425,13.0000,NaN,Southampton

In [10]:
data_1.drop(["PassengerId","Name","Ticket","Cabin","Fare","SibSp","Parch"],axis=1,inplace=True)

In [11]:
data_1.sample()

     Survived       Pclass   Sex   Age     Embarked
414         1  third class  male  44.0  Southampton

In [12]:
data_2 = pd.get_dummies(data_1["Embarked"])

In [13]:
data_3 = pd.get_dummies(data_1["Pclass"])

In [14]:
data_4 = pd.get_dummies(data_1["Sex"])

In [15]:
data = pd.concat([data_1,data_2,data_3,data_4],axis=1)

In [16]:
data.sample(5)

,Survived,Pclass,Sex,Age,Embarked,Cherbourg,Queenstown,Southampton,first class,second class,third class,female,male
690,1,first class,male,31.0,Southampton,0,0,1,1,0,0,0,1
680,0,third class,female,NaN,Queenstown,0,1,0,0,0,1,1,0
459,0,third class,male,NaN,Queenstown,0,1,0,0,0,1,0,1
816,0,third class,female,23.0,Southampton,0,0,1,0,0,1,1,0
879,1,first class,female,56.0,Cherbourg,1,0,0,1,0,0,1,0

In [17]:
data.drop(["Pclass","Embarked","Sex"],axis=1,inplace=True)

In [18]:
data["Age"] = data["Age"].fillna(data['Age'].median())

In [19]:
data.isnull().sum()

Survived        0
Age             0
Cherbourg       0
Queenstown      0
Southampton     0
first class     0
second class    0
third class     0
female          0
male            0
dtype: int64

In [20]:
X = data.drop("Survived",axis=1)
y = data["Survived"]

In [21]:
X.sample()

,Age,Cherbourg,Queenstown,Southampton,first class,second class,third class,female,male
7,2.0,0,0,1,0,0,1,0,1

In [22]:
y.sample()

558    1
Name: Survived, dtype: int64

In [23]:
X_train,X_test,y_train,y_test = train_test_split(X,y,test_size=0.2,random_state=0)

In [32]:
classifier = RandomForestClassifier(n_estimators=7,oob_score=True)

In [33]:
classifier.fit(X_train,y_train)

D:\Python_3.9.9\lib\site-packages\sklearn\ensemble\_forest.py:578: UserWarning: Some inputs do not have OOB scores. This probably means too few trees were used to compute any reliable OOB estimates.
  warn(

RandomForestClassifier(n_estimators=7, oob_score=True)

In [34]:
pred = classifier.predict(X_test)

In [35]:
pred

array([0, 0, 0, 1, 1, 0, 1, 1, 1, 1, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 0, 1,
       0, 0, 1, 1, 1, 1, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       1, 0, 0, 1, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 1, 0,
       1, 0, 1, 1, 1, 1, 0, 0, 0, 1, 0, 1, 0, 1, 0, 0, 1, 0, 0, 1, 1, 0,
       1, 0, 0, 0, 1, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 1,
       0, 1, 1, 0, 1, 1, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 1, 1, 0, 1, 0, 0, 0, 0, 1, 0,
       1, 0, 0, 0, 1, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0,
       1, 0, 0], dtype=int64)

In [36]:
# list(y_test)

In [37]:
y_test.tail(10)

500    0
222    0
1      1
425    0
760    0
780    1
837    0
215    1
833    0
372    0
Name: Survived, dtype: int64

In [38]:
from sklearn.metrics import accuracy_score,confusion_matrix
accuracy_score(y_test,pred)

0.8324022346368715

In [39]:
confusion_matrix(y_test,pred)

array([[98, 12],
       [18, 51]], dtype=int64)